EthanWu87/HOLTEK_Image_Classification_Project/template/HT32F493x5_FWLib_V1.2.2_184/project/ht32f49395_sk/examples/gpio/led_toggle/src/hm01b0.h
#ifndef _HM01B0_H_
#define _HM01B0_H_

#include <string.h>
#include <stdint.h>
#include <stdio.h>

#include "ht32f493x5.h"
#include "ht32f493x5_board.h"
#include "i2c_application.h"
#include "ht32f493x5_exint.h"

#define HM01B0_I2C_TIMEOUT            0xFFFFFFFF

#define HM01B0_I2C_SPEED              100000
#define HM01B0_I2C_ADDRESS            0x48

#define HM01B0_I2C_PORT               I2C1
#define HM01B0_I2C_CLK                CRM_I2C1_PERIPH_CLOCK

#define HM01B0_I2C_SCL_PIN            GPIO_PINS_6
#define HM01B0_I2C_SCL_PORT           GPIOB
#define HM01B0_I2C_SCL_GPIO_CLK       CRM_GPIOB_PERIPH_CLOCK

#define HM01B0_I2C_SDA_PIN            GPIO_PINS_7
#define HM01B0_I2C_SDA_GPIO_PORT      GPIOB
#define HM01B0_I2C_SDA_GPIO_CLK       CRM_GPIOB_PERIPH_CLOCK

#define HM01B0_I2C_EVT_IRQn           I2C1_EVT_IRQn
#define HM01B0_I2C_ERR_IRQn           I2C1_ERR_IRQn

#define HM01B0_PCLK_EXINT_PORT        GPIO_PORT_SOURCE_GPIOB
#define HM01B0_PCLK_EXINT_PIN         GPIO_PINS_2
#define HM01B0_PCLK_EXINT_CLK         CRM_GPIOA_PERIPH_CLOCK
#define HM01B0_PCLK_EXINT_IRQn        EXINT0_IRQn

void hm01b0_init(i2c_handle_type* hi2c);
void hm01b0_i2c_init(i2c_handle_type* hi2c);
void hm01b0_pclk_exint_init();
int  hm01b0_reset(i2c_handle_type* hi2c);
void hm01b0_write_reg8(i2c_handle_type* hi2c, uint16_t address, uint8_t value);
void hm01b0_write_reg16(i2c_handle_type* hi2c, uint16_t address, uint16_t value);
uint8_t  hm01b0_read_reg8(i2c_handle_type* hi2c, uint16_t address);
uint16_t hm01b0_read_reg16(i2c_handle_type* hi2c, uint16_t address);

#endif
